src/БиблиотекаИнструментовРазработки/src/InformationRegisters/бир_СобытияНазначенныеОбработчики/бир_СобытияНазначенныеОбработчики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бир_СобытияНазначенныеОбработчики</name>
  <resources>
    <name>ОтложеннаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РучнаяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОжидатьЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбрабатыватьНаКлиенте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбрабатыватьНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.бир_События</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникВозникновения</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
      <types>CatalogRef.бир_СобытияТочкиВозникновения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Обработчик</name>
    <type>
      <types>CatalogRef.бир_СобытияОбработчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/БиблиотекаИнструментовРазработки/src/InformationRegisters/бир_СобытияНазначенныеОбработчики/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Отбор.Свойство("Событие", Событие);

	ОбновитьДеревоСобытийНаСервере();
	ОбновитьСписокОбработчиковНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ДеревоСобытийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоСобытий.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Событие               = ТекущиеДанные.Событие;
		ИсточникВозникновения = ТекущиеДанные.ИсточникВозникновения;
	КонецЕсли;

	ПодключитьОбработчикОжидания("ОбновитьСписокОбработчиков", 0.3, Истина);
	
КонецПроцедуры // ДеревоСобытийПриАктивизацииСтроки()

&НаКлиенте
Процедура СписокПриИзменении(Элемент)

	ОбновитьДеревоСобытийНаСервере();

	Для Каждого ТекСтрока Из ДеревоСобытий.ПолучитьЭлементы() Цикл
		Элементы.ДеревоСобытий.Развернуть(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;

КонецПроцедуры // СписокПриИзменении()

&НаСервере
Процедура ОбновитьДеревоСобытийНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	События.Ссылка КАК Событие,
	                      |	НазначенныеОбработчики.ИсточникВозникновения КАК ИсточникВозникновения,
	                      |	"""" КАК Представление
	                      |ИЗ
	                      |	Справочник.бир_События КАК События
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бир_СобытияНазначенныеОбработчики КАК НазначенныеОбработчики
	                      |		ПО События.Ссылка = НазначенныеОбработчики.Событие
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &Событие = ЗНАЧЕНИЕ(Справочник.бир_События.ПустаяСсылка)
	                      |					ИЛИ &Событие = НЕОПРЕДЕЛЕНО
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ События.Ссылка = &Событие
	                      |		КОНЕЦ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Событие,
	                      |	ИсточникВозникновения
	                      |ИТОГИ ПО
	                      |	Событие");
	Запрос.УстановитьПараметр("Событие", Событие);

	Результат = Запрос.Выполнить();
	
	ВремДеревоСобытий = РеквизитФормыВЗначение("ДеревоСобытий");
	ВремДеревоСобытий.Строки.Очистить();
	
	ВыборкаСобытий = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСобытий.Следующий() Цикл
		
		НоваяСтрокаСобытия = ВремДеревоСобытий.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСобытия, ВыборкаСобытий);
		НоваяСтрокаСобытия.Представление = СокрЛП(ВыборкаСобытий.Событие);
		
		Выборка = ВыборкаСобытий.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = НоваяСтрокаСобытия.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Представление = СокрЛП(Выборка.ИсточникВозникновения);
		
		КонецЦикла;
	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ВремДеревоСобытий, "ДеревоСобытий");
	
КонецПроцедуры // ОбновитьДеревоСобытийНаСервере()

&НаКлиенте
Процедура ОбновитьСписокОбработчиков()
	
	ТекущиеДанные = Элементы.ДеревоСобытий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Событие.Видимость               = НЕ ЗначениеЗаполнено(Событие);
	Элементы.ИсточникВозникновения.Видимость = НЕ ЗначениеЗаполнено(ИсточникВозникновения);
	
	ОбновитьСписокОбработчиковНаСервере();
	
КонецПроцедуры // ОбновитьСписокОбработчиков()

&НаСервере
Процедура ОбновитьСписокОбработчиковНаСервере()
	
	Список.Параметры.УстановитьЗначениеПараметра("Событие"              , Событие);
	Список.Параметры.УстановитьЗначениеПараметра("ИсточникВозникновения", ИсточникВозникновения);
	
КонецПроцедуры // ОбновитьСписокОбработчиковНаСервере()
